[
  {
    "uid": "c5fe670a-3cf8-41c6-9252-460c8bb7c191",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Number 1 Hit & More!  YouTube Music Charts: Global Top Songs Nov 22 - Nov 28, 2024: .  APT. : ROSÉ & Bruno Mars. Die With A Smile : Lady Gaga & Bruno Mars. Aaj Ki Raat : Madhubanti Bagchi , Divya. Tu Boda : Óscar Maydon & Fuerza Regida. .  Kissik : Sublahshini. Si Antes Te Hubiera Conocido : KAROL G. Hey Minnale : Haricharan & Shweta Mohan. BIRDS OF A FEATHER : Billie Eilish.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "4932cd26-30a7-47bf-adc9-e5183e5b8c7c",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Spotify Weekly Top Songs Global, .  from the Friday, November 22 - Thursday, November 28, 2024: .  APT. : ROSÉ, Bruno Mars. Die With A Smile : Lady Gaga, Bruno Mars. luther (with sza) : Kendrick Lamar, SZA. BIRDS OF A FEATHER : Billie Eilish. .  squabble up : Kendrick Lamar. That’s So True : Gracie Abrams.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "4773a63a-a902-4182-8fcd-73633596fc7e",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "From the Netflix Global Top 10 list of November 18 - November 24, 2024..  Most viewed films, in English: .  The Merry Gentlemen. Hot Frosty. Spellbound. Minions: The Rise of Gru. .  Most viewed films, non English: .  GTMAX. The Lost Children. Let Go. Devara.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "849d6785-4357-4356-a11c-bec19757dceb",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "From the Netflix Global Top 10 list of November 18 - November 24, 2024..  Most watched TV in English: .  A Man on the Inside: Season 1. Arcane: Season 2. Cobra Kai: Season 6. .  Most viewed TV, non English: .  The Cage: Season 1. Sisters' Feud: Season 1. The Empress: Season 2. ",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "1737df07-563d-4dcd-bac7-e4990923a49d",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Nintendo US Digital best sellers, from 02/December/2024: .  Super Mario Party™ Jamboree. MySims™: Cozy Bundle. Stardew Valley. The Legend of Zelda™: Tears of the Kingdom.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "b588e567-896a-4c95-a480-94cfdc0fe2c0",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Steam's Hottest Games!  Global Top selling and top played games across Steam. .  From the Top 100 products by revenue For Tue, November 12, 2024 - Tue, November 19, 2024: .  Counter-Strike 2. Farming Simulator 25. PUBG: BATTLEGROUNDS. Call of Duty: Black Ops 6. ",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "1ce10db5-aa82-4f87-a712-d7be153b97b1",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "CISA's Cybersecurity Alerts & Advisories: .  CISA Releases Six Industrial Control Systems Advisories..  CISA Adds One Known Exploited Vulnerability to Catalog.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "563139d7-0c04-4d39-bd86-055e39392fa5",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "One More Drop in the AI Ocean: .  nvidia's Hymba-1.5B-Instruct, is a 1.5B parameter model finetuned from Hymba-1.5B-Base using a combination of open source instruction datasets and internally collected synthetic datasets. This model is finetuned with supervised fine-tuning and direct preference optimization. Hymba-1.5B-Instruct is capable of many complex and important tasks like math reasoning, function calling, and role playing.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "7d7a63bb-8a56-45ee-ae38-407005270730",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Russian criminals aided UK drug gangs in laundering lockdown funds, as the UK uncovers a vast cryptocurrency laundering scheme involving gangsters and Russian spies. .  At least eight U.S. telecommunication firms were targeted by China’s hacking campaign, according to the White House, prompting U.S. senators to pledge action after receiving a briefing on the Chinese Salt Typhoon telecom hacking incident. Additionally, it has been reported that numerous nations have been affected by the ‘China’ hack, while Americans were advised to cease sending texts, and U.S. officials urged Americans to utilize encrypted applications in response to the unprecedented cyberattack. .  Furthermore, smugglers were apprehended with 6,000 kilograms of methamphetamine, and they allegedly utilized Elon Musk’s Starlink satellite system for navigation.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "93e05a42-7cce-4569-8576-c477dbcd14ac",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Reportedly, OpenAI’s 12 days celebration of ‘shipmas’ features Sora and a novel reasoning model. Meanwhile, ChatGPT surpasses 300 million weekly active users..  Baidu is confirmed as China’s Apple Intelligence model provider, but privacy concerns persist. .  As reported by The Information, Apple encounters challenges in adapting Baidu’s AI models for Chinese users. In other news, Google unveils new image and video generative AI models, Imagen 3 and Veo.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "dee6a1c2-0c00-4c28-9d85-b318b06a767e",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Amazon has been accused of “secretly” excluding low income neighborhoods from Prime delivery, as stated by the District of Columbia’s Attorney General. .  Additionally, the European Union is considering targeting ultra-low-cost e-tailers such as Shein and Temu with package handling fees or import taxes. .  Furthermore, the UK police forces have quietly withdrawn from the X platform due to concerns about the content on the platform.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "7986e1bb-c346-4173-a497-0e2d5e230004",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Joe Rogan maintained the top spot on Spotify’s podcast charts for the entire year of 2024..  In a significant development, DAZN secured a historic free to view deal with FIFA, granting them the exclusive rights to broadcast the FIFA Club World Cup 2025™ globally. .  Additionally, IRA bomber Marian Price filed a lawsuit against Disney+ regarding the depiction of a murder scene in the TV show “Say Nothing.”",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "12177b1d-ac22-4008-94d9-d55633eb48f4",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "SenseTime is restructuring its focus to prioritize AI cloud and vision models. .  Meanwhile, Western AI firms are expressing concerns about potential censorship in China’s AI models..   In another development, OpenAI and Anduril are collaborating to develop antidrone AI for the U.S. defense sector.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "422659a4-9145-4b4b-b9c0-c30b704cc575",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "New York Post comments that Joe Biden’s predictable pardon of Hunter didn’t threaten his reputation but rather cemented an already corrupt legacy. .  Bernie Sanders asserts that Elon Musk is “a very smart guy,” and believes for Robert F. Kennedy Jr. that is right our society is “unhealthy.” .  Jared Isaacman, a billionaire who paid for two SpaceX flights, was chosen as the new NASA administrator by Trump.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "09e1017b-e34b-4ce1-8827-18a5f7c7b12d",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "The United Kingdom has banned daytime television advertisements for cereals, muffins, and burgers. .  A study reveals that nearly 30% of U.S. drugstores closed in the past decade. Additionally, the study claims that maternity wards closed at most U.S. rural hospitals..  Furthermore, a study in the United States found that waterborne disease outbreaks were associated with splash pads. The illnesses transmitted by ingesting water contaminated with feces.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "1b9c0a65-2ac9-4e83-9127-651cf8627028",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "The world’s oldest known albatross laid an egg at the remarkable age of 74. .  Two years ago, scientists discovered that Antarctica’s Conger ice shelf had been weakening for decades before its catastrophic collapse. .  Archaeologists have also made a significant discovery, suspecting that a shipwreck found near Kenya may be from Vasco da Gama’s final voyage.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "d095b651-de93-4187-893a-579346d2001f",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Mexico detained over 5,200 migrants in a single day, despite Trump’s threats. .  Migrant caravans persist, and Mexican troops seized a record fentanyl haul just days after Trump threatened tariffs. .  The U.S. is offering a $15 million reward for the arrest of Mexican cartel leader “El Mencho.”",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "01661ffe-86df-444a-b80e-ff735a0c6ef7",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "French lawmakers vote to oust prime minister, in the first successful no confidence vote since 1962..  Yale List Picks 'Taylor Swift Childless Cat Lady' as 2024's Top Quote..  MSNBC comments as, South Korea just gave Donald Trump a warning, if his opponents are listening. South Korean Leader Will Face Impeachment Vote Over Martial Law Declaration. South Korean opposition leader thought martial law announcement was ‘a deepfake’.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "d46bb743-54c2-47c3-87e7-ca158e587f8b",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Trump nominates cryptocurrency advocate Paul Atkins as the new chair of the Securities and Exchange Commission (SEC). .  Meanwhile, Robinhood CEO Vlad Tenev is reportedly considering a move into the sports betting industry..  Additionally, Trump’s cryptocurrency project has secured a significant $30 million investment from Justin Sun.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "2fa71564-e04e-4a45-a252-f248baa06842",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Ethnic Slovak naive paintings from Serbia have been added to UNESCO’s list of cultural heritage, while the roof restorers of Paris have received UNESCO Cultural Heritage recognition. .  Additionally, X rays have revealed a tiny 19th century beetle embedded within a Paul Gauguin painting. .  Furthermore, a Swiss auction firm has made history as the first to sell art solely authenticated by artificial intelligence.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "9aade5a0-e9c9-440d-adca-554212567c1b",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "The world is entering its third nuclear age with few safeguards, according to the UK military chief..  Additionally, the U.S. is constructing an early warning system to detect geoengineering..  Georgian opposition figures have been arrested amidst ongoing proEU protests.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "77b569c7-81c7-495a-bf9b-35ff0960859b",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Threads users can now follow profiles from other federated servers..  With the Bluesky Open API, data scrapers can access Firehouse for AI training, as demonstrated by Hugging Face..  Korea arrests the CEO for adding a DDoS feature to satellite receivers.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "b330ab73-ab79-4ae4-b93f-94dd6db776e9",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "NHL Announces Finland and Sweden Rosters for the 2025 4 Nations Face Off, Featuring the USA and Canada..  Spotify and NotebookLM have collaborated to develop a personalized AI podcast that captures your year in audio..  Scottish artist Jasleen Kaur made history by winning the Turner Prize 2024 for an innovative installation that transformed a car into a doily.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "c66ace71-93f1-4a63-88e8-c175aca367ca",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "In the Baltic Sea, a Russian ship fired signaling ammunition at a German army helicopter..  Bloomberg commented stating that Europe’s newest startup trend is the development of AI powered weapons. Helsing, a defense AI company in Europe, unveiled an intelligent swarm capable strike drone capable of mass and precision strikes..  In a rare phone call, the Russian defense chief cautioned the top US general about conducting a large scale military exercise in the Mediterranean Sea. This call was between Russia’s top general and the chairman of the US Joint Chiefs of Staff, and it focused on discussing ATACMS, Oreshnik, and North Korean troops.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "54ab6b98-a2a0-4e6d-bf13-4ba722c5d049",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Cuba’s electric grid collapses after a power plant failure, leaving millions in the dark. .  Thai PM Paetongtarn eyes the national disaster centre to handle floods and droughts, as Thailand plans to set up a national disaster management centre. .  Saxo launches its flagship 2025 ‘Outrageous Predictions’ report, one of which forecasts that a natural disaster will bankrupt a large insurance company for the first time.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "10c5ce43-2a56-498a-b05d-7ed864c57376",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "TikTok Shop’s Black Friday sales tripled, surpassing $100 million..  Tesla instructed its workers to remain home as demand for the Cybertruck declined. .  Shell and Equinor are forming a joint venture to establish the UK’s largest independent oil and gas producer.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "596a081b-d952-4e5c-89ad-3b85594a428a",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Russia linked Turla exploits Pakistani hackers’ servers to target Afghan and Indian entities. .  US chips are deemed unsafe by Chinese industry bodies in their latest trade criticism. .  Romania was the target of ‘aggressive hybrid Russian attacks’ during its elections, as stated by the security council.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "eca31fff-e51c-4c04-88e2-7a9942ea7ab7",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Caffeine’s influence on the brain’s mesolimbic dopaminergic pathway could potentially diminish the addictive effects of alcohol..  In a study titled “The Effect of Sex on Immune Cells in Healthy Aging,” it was discovered that elderly women possess more robust natural killer lymphocytes compared to their male counterparts..  An intriguing discovery was made when a hidden entrance to a mysterious ancient temple was found concealed within the cliffs of Egypt.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "0f001186-d234-4970-ad83-3d93357acb51",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Crypto trading volume reached a record breaking $10 trillion in November, marking a significant milestone in the industry. .  Meanwhile, a Texas judge has blocked the nationwide enforcement of an antimoney laundering law, while the Federal Court has temporarily halted the enforcement of the Corporate Transparency Act..  Additionally, British regulators have approved a $19 billion merger between Vodafone and Three mobile operators.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "f42cf392-6f48-4d0b-951a-8cb806af7b3c",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Blinken intends to provide the incoming successor, Rubio, with the most favorable circumstances possible..  Amnesty International’s investigation reveals that Israel is perpetrating genocide against Palestinians in Gaza..  The US apprehends an individual suspected of assisting North Korea in preparing a ‘surprise attack’ on South Korea.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "36ec04ef-d219-45e6-9d5c-a72e9eb10ac3",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Elon Musk intends to significantly expand the Colossus AI supercomputer’s capabilities by a factor of ten..  In parallel, Google DeepMind has unveiled Genie 2, an autoregressive latent diffusion model designed for virtual world and game creation, requiring minimal input. .  Moreover, the PlayStation chief emphasizes the transformative potential of AI in gaming but underscores the importance of striking a balance between technological advancements and maintaining a “human touch.”",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  },
  {
    "uid": "7a75ee80-d811-45fc-b4d2-0883a25b4aa0",
    "updateDate": "2024-12-06T00:00:00.0Z",
    "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
    "mainText": "Taylor Swift’s ‘Eras Tour’ Book Makes History, Selling a Reported 814,000 Copies in Just Two Days..  Elden Ring 2 is Not in Development, But FromSoftware Has Multiple Projects in the Works, Spanning a Variety of Genres, According to Hidetaka Miyazaki. Miyazaki also shared that Elden Ring might be as ambitious a game as he ever envisions: “Where FromSoftware is right now, in terms of scale, I would say Elden Ring is truly the limit.”.  In an astonishing discovery, researchers have unearthed a 480 years old firearm in Arizona, described as the oldest ever found in the United States.",
    "redirectionUrl": "https://github.com/newssourcecrawler"
  }
]
