[
{
  "uid": "bcb4b87b-02da-468b-8df3-bdb84bb28e17",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Number 1 Hit & More! YouTube Music Charts: Global Top Songs from November 22, 2024, to November 28, 2024: .  1. **APT.**: ROSÉ & Bruno Mars - “Die With A Smile” .  2. **Lady Gaga & Bruno Mars**: “Aaj Ki Raat” .  3. **Óscar Maydon & Fuerza Regida**: “Tu Boda” .  4. **Sublahshini**: “Kissik” .  5. **KAROL G.**: “Si Antes Te Hubiera Conocido”",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "22f8074b-434d-44ac-8ee5-1f120692c441",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Spotify’s Weekly Top Songs Global chart, from Friday, November 22, 2024, to Thursday, November 28, 2024, features the following songs:.  1. **APT.** by ROSÉ featuring Bruno Mars 2. **Die With A Smile** by Lady Gaga featuring Bruno Mars. 3. **luther (with sza)** by Kendrick Lamar featuring SZA. 4. **BIRDS OF A FEATHER** by Billie Eilish. 5. **squabble up** by Kendrick Lamar",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "bface58c-1126-4472-bdc5-3a5c93c32157",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "From the Netflix Global Top 10 list from November 18 to November 24, 2024, here are the most viewed films in English: - The Merry Gentlemen. - Hot Frosty. - Spellbound. - Minions: The Rise of Gru. .  And here are the most viewed films in non-English languages: - GTMAX. - The Lost Children. - Let Go. - Devara.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "1ed649ad-eada-40e4-ad96-602fda7d700a",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "From Netflix’s Global Top 10 list for the period from November 18, 2024, to November 24, 2024, here are the most-watched TV shows in English: - A Man on the Inside: Season 1. - Arcane: Season 2. - Cobra Kai: Season 6..  And here are the most-viewed TV shows in non-English languages: - The Cage: Season 1. - Sisters’ Feud: Season 1. - The Empress: Season 2 ",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "7557a5c2-15fd-4491-abae-bb827cc176ec",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Nintendo US Digital best sellers, from 02 December 2024: .  Super Mario Party™ Jamboree. MySims™: Cozy Bundle. Stardew Valley. The Legend of Zelda™: Tears of the Kingdom.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "d7da4d1d-b1e9-4e30-b592-1cff414891e0",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Steam’s Hottest Games! Discover the top-selling and most played games across the platform. .  From the Top 100 products by revenue list, for the period from Tuesday, November 12, 2024, to Tuesday, November 19, 2024: .  Counter-Strike 2. Farming Simulator 25. PUBG: BATTLEGROUNDS. Call of Duty: Black Ops 6.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "71c84218-abfc-4240-9183-e76d92e17226",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "CISA’s Cybersecurity Alerts and Advisories: .  CISA has released six Industrial Control Systems (ICS) advisories and added one known exploited vulnerability to its catalog.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "673b14c9-9731-40fe-92e3-e9c3dfbbb267",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "One More Drop in the AI Ocean: .  NVIDIA’s Hymba-1.5B-Instruct, a 1.5 billion parameter model, is a refined version of Hymba-1.5B-Base. It has been fine-tuned using a combination of open-source instruction datasets and internally generated synthetic datasets. The model has been trained through supervised fine-tuning and direct preference optimization. Hymba-1.5B-Instruct demonstrates remarkable capabilities in performing complex and significant tasks, including mathematical reasoning, function calling, and role-playing.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "29d13529-8086-48f0-b06a-29e2612ad87e",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "OpenAI unveils its full OpenAI o1 model, enabling image uploads and analysis, and introduces ChatGPT Pro. .  Microsoft launches Copilot Vision, an AI tool that can read your screen, in a preview. .  Additionally, China reduces fighter pilot training by a year, aiming for a complete overhaul by early 2030s.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "09db7ee3-a68b-4aa1-9c05-7e9035679972",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Waymo plans to expand its operations to Miami and aims to launch its robotaxi service there by 2026. .  .  Additionally, a Consumer Reports survey reveals that electric vehicle reliability is improving, although it still trails behind gas powered models.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "6a35bfd5-3d46-4c09-9236-dc7ba88ba001",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Reuters reports that TSMC is in discussions with Nvidia regarding the production of AI chips in Arizona, according to sources..  Additionally, Meta is set to invest $10 billion in a data center in Louisiana. .  Furthermore, OpenAI has reached a content deal with the owner of Tom’s Guide, Future.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "6ba66838-55ab-400d-bb59-ea6037f5a38a",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Crypto startups that were ousted as Ponzi schemes by the US are now thriving in Dubai..  McKinsey agrees to pay a $122 million settlement to resolve a bribery case in South Africa, and a former McKinsey Africa director admits to bribing Eskom and Transnet officials as part of a guilty plea..  The legendary Medellin cartel drug lord is released from US prison after serving 25 years.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "7418b023-74b6-4946-861c-b648b75a4b18",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Streaming giant Twitch is currently facing controversy due to content creators’ criticism of its handling of the Israel and Palestine conflict. In response to these claims, JPMorgan and AT&T have pulled their ads from Twitch..  Additionally, Amazon’s Prime Video is expanding its subscription options by adding Apple TV+ as an add on. .  Furthermore, TikTok has collaborated with Nielsen to monitor the performance of crossmedia advertising campaigns.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "40935139-5f2f-41ea-a2ff-842bbc11b897",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "The Bahamas has rejected Trump’s proposal to accept deported third country migrants. Also, Mexico’s president will request that Trump deport non Mexican migrants directly to their home countries, as the incoming Trump administration plans to deport some migrants to countries other than their own..  Additionally, the Census Bureau director has stated that the inclusion of a citizenship question in the 2030 census would ‘dampen participation.’ Furthermore, four years ago, Trump signed a memo that omitted undocumented immigrants from the census apportionment count. .  In the aftermath of Trump’s victory, some women are considering the 4B movement, which advocates for abstaining from sex, dating, marriage, and having children, which seeks to swear off men, has grown.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "025b56ff-3352-4531-8f53-4b7282cf1da8",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Russia has revoked the rehabilitations of 4,000 Soviet era victims of political repression, restoring their status as “traitors to the Motherland.” .  In other news, an Italian nun was among the 25 individuals arrested during a raid against the ‘Ndrangheta mafia. .  Additionally, the EU naval force reported that a Chinese fishing vessel was under the control of alleged pirates in Somali waters.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "69fc9cba-5299-47ce-8f71-30009130175a",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "James Cameron’s Lightstorm Vision and Meta Ink a Multia Year Partnership For 3D Entertainment..  WWE To Remain Family Friendly In 2025’s Netflix Era..  Pantone Names Mocha Mousse 2025 Color Of The Year.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "e4d0a653-b98d-4f1d-8e56-326c5548b965",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Satellite images reveal that Iran’s newly constructed drone carrier has embarked on its maiden voyage, departing from its home port for the first time. .  Additionally, Israeli intelligence suggests an increasing likelihood of Assad’s forces experiencing a collapse in Syria. .  Furthermore, a relative of Putin has disclosed that approximately 48,000 Russian soldiers may be missing in action in Ukraine.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "664053b7-7450-4a68-a06a-86a32cbfe959",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "OPEC+ postpones the oil output hike until April 2025 and extends the cuts until 2026..  Decline in Reflective Low Clouds may have contributed to the recent record breaking heat..  Vanuatu urges the World Court to acknowledge the impacts of climate change, as Vanuatu’s youth led climate change movement prepares to present its case at the International Court of Justice.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "0d60f51f-1672-43e8-a0cf-1e11bec41619",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Oldest known remnants of archery in Europe have been discovered in Spain’s Bat Cave. .  The Largest Stegosaurus Fossil Ever Found was sold for $44.6 million at Sotheby’s to billionaire Ken Griffin. .  Researchers have discovered that wood can glow in the dark for days due to a fungus that infects trees.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "0afa8376-20d0-4675-92a7-f683ec2bb695",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Pakistan’s jailed former Prime Minister Imran Khan warns of civil disobedience if released. Last week, Imran Khan was indicted on charges of inciting attacks against the military. .  Meanwhile, Canada has banned additional types of firearms and is considering donating guns to Ukraine. .  Additionally, a Ukrainian group in the US opposes the expansion of Starlink due to concerns about Elon Musk’s ties to Russia.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "a9392777-f5e8-412b-a53a-46ad484fd569",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "The Thirty-Eighth Annual Conference on Neural Information Processing Systems, aptly named the “Olympics of AI,” will be held at the Vancouver Convention Center from Tuesday, December 10, to Sunday, December 15. .  In other news, President Trump has appointed David Sacks, a prominent ally of Elon Musk, as the “AI & crypto czar” to oversee policy coordination. .  Additionally, Citi analysts predict that humanoid robots could generate a substantial market value of $7 trillion within the next 25 years.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "ccf754f4-360f-4aa0-a923-1d7965b0e767",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Elon Musk Spent Over $250 Million to Help Elect Trump..  Trump talks up his transition and election victory as he receives Fox Nation award..  NY Times comments as, Trump Could Take Us to War With Iran. But He Could Also Broker Peace.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "5ddf85d7-8da9-47c0-97d9-ec11af6cda5e",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "China is easing export restrictions on small packages to facilitate e-commerce and support flexible jobs. .  In response to the EU’s EV tariffs, Chinese car manufacturers are turning to hybrids. .  To counter the US’s proposed 20% price reduction on domestic products, China is also making moves.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "5c5144dc-27a5-47d4-b5dc-59a1e22cbde3",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Critics Choice Awards nominations have been announced, and FX’s Shōgun leads the TV nominations..  Kraftwerk is celebrating 50 years of their iconic song “Autobahn” and has announced a 2025 North American tour..  Additionally, Riot Games has unveiled Project K, the League of Legends card game.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "fa555984-c4a8-4e9a-b0af-5a7b5f28c2b4",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "The LPGA and USGA have implemented a new policy that requires female athletes to undergo a gender change if they were born female or if they transitioned before puberty..  In contrast, Switzerland has a more lenient policy that allows 16 years old individuals to change their gender entry without the consent of their parents. .  Additionally, the Tokyo government has introduced a new policy that provides workers with a four days workweek to promote fertility and enhance family time.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "59787806-410e-4d3c-a282-88b8d9afbd4e",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "The Federal Bureau of Investigation is investigating the Com’s use of cybercriminal tactics to commit violent crimes. .  Additionally, 65% of employees bypass cybersecurity policies due to the hybrid work and flexible access arrangements. .  Furthermore, a group with a combined age of 215 years has been filed a $18.5 million damages claim against, for the Stealth Piracy App Trio.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
{
  "uid": "76e5fb88-ed92-4658-8ab4-03d01235f6b8",
  "updateDate": "2024-12-06T00:00:00.0Z",
  "titleText": "NewsSourceCrawler daily digest from developments news and events (TTS) ",
  "mainText": "Scientists have developed the world’s first carbon 14 diamond battery, boasting an impressive 5,000 years lifespan. This groundbreaking device harnesses the power of radioactive decay to generate low power levels. .  On the other hand, NASA has announced a further delay in its moon mission, but remains steadfast in its goal of landing astronauts before China.",
  "redirectionUrl": "https://github.com/newssourcecrawler"
}
,
]
